/* 2352018 信06 刘彦 */
#include <iostream>
#include <conio.h>
using namespace std;

/***************************************************************************
  函数名称：hanoi_menu
  功    能：显示各菜单项，读入正确的选项后返回
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int magic_menu()
{
    // 输出菜单选项  
    cout << "------------------------------------------------------------" << endl;    // 输出菜单上方的分隔线
    cout << " 1.内部数组，生成初始状态，寻找是否有初始可消除项" << endl;
    cout << " 2.内部数组，消除初始可消除项后非0项下落并用0填充" << endl;
    cout << " 3.内部数组，消除初始可消除项后查找消除提示" << endl;
    cout << " 4.n*n的框架(无分隔线)，显示初始状态" << endl;
    cout << " 5.n*n的框架(有分隔线)，显示初始状态" << endl;
    cout << " 6.n*n的框架(无分隔线)，显示初始状态及初始可消除项" << endl;
    cout << " 7.n*n的框架(有分隔线)，消除初始可消除项后显示消除提示" << endl;
    cout << " 8.cmd图形界面完整版(有分隔线，鼠标移动时显示坐标，右键退出)" << endl;
    cout << " 9.cmd图形界面完整版" << endl;
    cout << " 0.退出" << endl;
    cout << "------------------------------------------------------------" << endl;   // 输出菜单下方的分隔线

    cout << "[请选择:]";
    int ch1, ch2;
    ch1 = _getch();
    while (1)
    {
        ch2 = ch1 - 48;    // 将用户输入的数字字符转换为对应的整数值并返回

        if (ch2 >= 0 && ch2 <= 9) // 如果输入是数字，跳出循环
            break;
        ch1 = _getch();  // 获取用户按下的键的 ASCII 值

    }
    cout << ch2 << endl;   // 显示用户输入数字
    return ch2;   // 返回用户按下的键的数值
}